app/controllers/iknow3g_controller.rb

  def setup
    @user = Iknow3gUser.find_by_name params[:user][:name]
    if @user
      if session[:user] and session[:user] == @user
        @user.password = params[:user][:password]
      else
        @user.check_or_raise params[:user][:password]
      end
      @user.iknow_user = params[:user][:iknow_user]
    else
      @user = Iknow3gUser.new params[:user]
    end
    @user.save!
---
SELECT "iknow3g_users".id FROM "iknow3g_users" WHERE ("iknow3g_users"."name" = 'technohippy' AND "iknow3g_users".id <> 1) LIMIT 1
INSERT INTO "iknow3g_users" ("name", "updated_at", "iknow_user", "password", "created_at") VALUES('guest', '2009-01-07 16:29:19', 'technohippy', 'guest', '2009-01-07 16:29:19')

  def answer
    set_back_to_index
    set_progress_bar
    @anwer = params[:answer]
    @success = normalize_word(params[:question]) == normalize_word(params[:answer])
    @progress = Iknow3gProgress.find params[:progress_id]
---
SELECT * FROM "iknow3g_progresses" WHERE ("iknow3g_progresses".iknow3g_exam_id = 43 AND (finished_at IS NULL))

  def complete
    @items = Iknow3gExam.find(params[:exam_id]).items
---
SELECT * FROM "iknow3g_exams" WHERE ("iknow3g_exams"."id" = 43)

  def show_item
    @item = Iknow3gItem.find params[:id]
---
SELECT * FROM "iknow3g_items" WHERE ("iknow3g_items"."id" = 190)